[
    {
        "company": {
            "name": "Bayfield School District",
            "class": "bsd",
            "site": "https://bayfield.k12.co.us"
        },
        "title": "IT Technician",
        "technologies": "Windows, Linux, Google Admin",
        "location": "Bayfield, CO.",
        "duration": "October 2024 - Present",
        "callouts": [
            "Lead modernization efforts to migrate legacy bash scripts to Go, improving maintainability and reliability of Student Information System (SIS) integrations",
            "Establish version control practices by moving server-side automation code to GitHub, enhancing collaboration and code quality",
            "Provide technical support across 4 schools, managing device deployment and repair, security infrastructure, and network administration",
            "Collaborate with Data Service Coordinator to enhance Student Information System (SIS) integrations with Active Directory",
            "Implement and maintain Google Admin and Active Directory policies, ensuring secure and efficient user management"
        ]
    },
    {
        "company": {
            "name": "Yardzen",
            "class": "yardzen",
            "site": "https://yardzen.com"
        },
        "title": "Sr. Growth Engineer",
        "technologies": "React, Next, Nest, Typescript",
        "location": "Remote",
        "duration": "Oct. 2023 - April 2024",
        "callouts": [
            "Partnered with Product and Design teams to develop high-impact, high-performance web pages with a strong emphasis on UI/UX.",
            "Contributed to building a dynamic marketplace using React, Next.js, NestJS, and GraphQL, working collaboratively with Product, Design, and Engineering teams.",
            "Participated in growth discussions with Marketing, Product, and Design teams to align technical solutions with business objectives."
        ]
    },
    {
        "company": {
            "name": "Wild Alaskan",
            "class": "wild",
            "site": "https://wildalaskancompany.com"
        },
        "title": "Sr. Software Engineer",
        "technologies": "PHP, Laravel, Vue, Vuex",
        "location": "Remote",
        "duration": "Oct. 2020 - Oct. 2023",
        "callouts": [
            "Reduced onboarding bounce rates by 57%, increasing conversion rates by 11% and reducing acquisition costs through performance optimization",
            "Developed internal SEO/marketing tools with Performance Marketing to streamline the management of SEO metadata, addressing key pain points.",
            "Worked closely with Data Analytics and Performance Marketing to ensure a seamless transition to the Google Analytics 4 platform, including sweeping changes to the front and backend systems",
            "Advocated for better UI/UX design in partnership with Product and Design teams, driving improvements in user experience.",
            "Led migration from Vue/Laravel SPA to modern Vue 3 and Nuxt 3 architecture, improving maintainability",
            "Enhanced site performance and reliability through collaborative engineering efforts, contributing to a more robust online presence.",
            "Established standardized code styles and best practices for JavaScript and Vue frameworks"
        ]
    },
    {
        "company": {
            "name": "Fx5 Solutions",
            "class": "fx5",
            "site": "https://fx5solutions.com"
        },
        "title": "Software Developer",
        "technologies": "PHP, Lumen, Redis, Docker, HTML, CSS/SASS, Vue, Javascript",
        "location": "Westminster, CO & Remote",
        "duration": "April 2019 - Oct. 2020",
        "callouts": [
            "Implemented Lumen to create centralized API architecture, streamlining data processing",
            "Enhanced system performance through Redis integration and SQL query and view optimizations",
            "Maintained SaaS product while improving coding standards",
            "Helped monitor server health and performance, including planning and executing maintenance windows for deployments and upgrades",
            "Collaborated with Support and QA teams to ensure timely and effective resolution of incoming issues"
        ]
    },
    {
        "company": {
            "name": "The Integer Group",
            "class": "tig",
            "site": "https://integer.com"
        },
        "title": "Full Stack Developer",
        "technologies": "PHP, Algolia, Docker, Active Directory/LDAP, HTML, CSS/SASS, NodeJs, Vue, Javascript",
        "location": "Denver, CO",
        "duration": "Oct. 2017 - April 2019",
        "callouts": [
            "Developed and maintained global office web applications within the LAMP stack and modern frontend technologies like Vue",
            "Created \"Hey Listen\" - a custom push notification system integrating websockets, Node.js, LDAP, and Slack",
            "Developed custom Slack Bot functions to automate support team operations",
            "Developed an internal Composer package for standardizing email templates"
        ]
    },
    {
        "company": {
            "name": "liquidfish",
            "class": "lf",
            "site": "https://liquid.fish"
        },
        "title": "Full Stack Developer",
        "technologies": "PHP, Laravel, HTML, CSS/SASS, Vue, Javascript",
        "location": "Oklahoma City, OK",
        "duration": "Aug. 2015 - Oct. 2017",
        "callouts": [
            "Collaborated with clients, designers, and project managers in a creative agency environment to deliver custom tailored brand and web solutions",
            "Developed 30+ custom websites primarily within the LAMP stack and Laravel, managing Linux server configurations and deployments",
            "Contributed to an in-house Laravel CMS",
            "Implemented and optimized nginx configurations for high-traffic client websites",
            "Contributed to the development of high-profile projects for professional athletes, including Kevin Durant and Blake Griffin"
        ]
    },
    {
        "company": {
            "name": "Amateur Softball Association",
            "class": "asa",
            "site": "https://www.teamusa.org/usa-softball/"
        },
        "title": "Full Stack Developer",
        "technologies": ".Net, ASP, ASP.Net, PHP, HTML, CSS, Javascript",
        "location": "Oklahoma City, OK",
        "duration": "May 2013 - Aug. 2015",
        "callouts": [
            "Enhanced Register ASA platform serving 300,000+ annual users",
            "Developed the ACE Certification platform and video training system",
            "Created a Women's College World Series Bracket Challenge featured on ESPN",
            "Built and maintained the Umpire Rulebook Android application"
        ]
    },
    {
        "company": {
            "name": "Mathis Brother's Studio",
            "class": "math",
            "site": "https://www.mathisbrothers.com/"
        },
        "title": "Front End Developer",
        "technologies": ".Net, ASP, ASP.Net, HTML, CSS, Javascript",
        "location": "Oklahoma City, OK",
        "duration": "June 2012 - Jan. 2013",
        "callouts": [
            "Help maintain Mathis Brother's eCommerce platforms",
            "Increased website performance through image, style, and code optimization",
            "Lead developer on updating and refreshing Mathis Sleep Studio and Big Red Warehouse"
        ]
    },
    {
        "company": {
            "name": "Advanced Academics",
            "class": "adv",
            "site": "http://advancedacademics.com/"
        },
        "title": "508 Compliance Specialist",
        "technologies": "HTML, CSS, Javascript",
        "location": "Oklahoma City, OK",
        "duration": "June 2011 - Dec. 2011",
        "callouts": [
            "Converted old course material to the updated 508 Compliance standards",
            "Lead a small team of four to complete several courses ahead of schedule",
            "Created scripts and styles to be implemented by other teams for future use"
        ]
    }
]
